export default {
  imagePath: `\\\\SHABANANEW\\soliderphotos\\`,
  recommendationPassword: "qwerty",
  SoldierLevel: {
    text: "text",
    value: "text",
    data: [...["جندي", "عريف", "رقيب", "رقيب اول", "مساعد", "مساعد اول"]]
  },
  KnowledgeLevel: {
    text: "text",
    value: "text",
    data: [...["عليا", "فوق متوسطة", "متوسطه", "عادة"].map(text => ({ text }))]
  },
  matrialStatus: {
    text: "text",
    value: "text",
    data: ["اعزب", "متزوج", "مطلق", "ارمل"].map(text => ({ text }))
  },
  Religion: {
    text: "text",
    value: "text",
    data: [...["مسيحي", "مسلم"].map(text => ({ text }))]
  },
  LevelOfImportance: {
    text: "text",
    value: "text",
    data: [
      ...["أهمية قصوى", "مهم جدا", "مهم", "اقل أهمية"].map(text => ({ text }))
    ]
  },

  levelMapping: {
    عليا: "High",
    "فوق متوسطة": "AboveAvg",
    متوسطه: "Avg",
    عادة: "Normal"
  },
  levelMapping: {
    عليا: "High",
    "فوق متوسطة": "AboveAvg",
    متوسطه: "Avg",
    عادة: "Normal"
  },
  levelMappingEn: {
    High: "عليا",
    Avg: "متوسطه",
    Normal: "عادة",
    AboveAvg: "فوق متوسطة"
  },
  RecommendTypes: {
    data: [...["مقترح فعلي", "مقترح اثناء التوزيع"].map(text => ({ text }))]
  },
  RecuTreat: {
    text: "text",
    value: "text",
    data: [
      ...["بدون", "سنة قابلة للرفع", "سنة غير قابلة للرفع"].map(text => ({
        text
      }))
    ]
  },
  Treatment: {
    text: "text",
    value: "text",
    data: ["ثلاث شهور", "ست شهور", "سنتين"].map(text => ({ text }))
  },
  DriverLevel: {
    text: "text",
    value: "text",
    data: ["اولي", "ثانية", "بدون"].map(text => ({ text }))
  },
  SoldierCategory: {
    text: "text",
    value: "text",
    data: [
      ...[
        "صف",
        "كاتب عسكرى",
        "كاتب مالى",
        "سائق عجل",
        "مهنى",
        "حرفى"
      ].map(text => ({ text }))
    ]
  },
  OfficerCategory: {
    text: "text",
    value: "text",
    data: [
      ...["عامل", "شرف", "تعاقد ش.ض", "فني", "إحتياط"].map(text => ({ text }))
    ]
  },

  OfficerLevels: {
    text: "text",
    value: "text",
    data: [
      ...[
        "ملازم",
        "ملازم أ",
        "نقيب",
        "رائد",
        "مقدم",
        "عقيد",
        "عميد",
        "لواء",
        "فريق"
      ].map(text => ({ text }))
    ]
  },
  Khedma_Type: {
    data: [
      {
        text: "راتب عالى"
      },
      {
        text: "مجند"
      },
      {
        text: "رع/مجند"
      }
    ]
  },
  BloodType: {
    text: "text",
    value: "text",
    data: [
      ...[
        "A",
        "A+",
        "A-",
        "B",
        "B+",
        "B-",
        "O",
        "O+",
        "O-",
        "AB",
        "AB+",
        "AB-"
      ].map(text => ({ text }))
    ]
  },
  RecuRegion: {
    text: "text",
    value: "text",
    data: [
      ...[
        "القاهرة",
        "الجيزة",
        "الأسكندرية",
        "الزقازيق",
        "أسيوط",
        "طنطا",
        "قنا",
        "المنصورة",
        "المنيا"
      ].map(text => ({ text }))
    ],
    dataInArray: [
      "القاهرة",
      "الجيزة",
      "الأسكندرية",
      "الزقازيق",
      "أسيوط",
      "طنطا",
      "قنا",
      "المنصورة",
      "المنيا"
    ]
  },
  RecuStage: {
    text: "text",
    value: "text",
    data: [
      { text: "الاولي", value: "1-3", count: "1" },
      { text: "الثانية", value: "1-6", count: "2" },
      { text: "الثالثة", value: "1-9", count: "3" },
      { text: "الرابعة", value: "1-12", count: "4" }
    ]
  },
  Certificator: {
    data: [
      "السيد/قائد القوات",
      "السيد /نائب قائد القوات",
      "السيد/ رئيس الاركان",
      "السيد/ رئيس شعبةالتنظيم والادارة",
      "السيد/ رئيس فرع الافراد",
      "مذكرة العرض"
    ].map(text => {
      return { text };
    })
  },

  SoldierStatus: {
    text: "text",
    value: "text",
    data: [
      ...["مستجد بالمركز", "بالخدمة", "منتهى خدمته"].map(text => ({ text }))
    ],
    newData: [...["مستجد بالمركز"].map(text => ({ text }))],
    endReason: [
      ...[
        "",
        "محول الى متطوع",
        "منتهى خدمته",
        "ترقى ملازم شرف",
        "نقل على الإحتياط",
        "اعفاء نهائى",
        "اعفاء مؤقت",
        "القبول بالكليات العسكريه",
        "رفت جوازى",
        "رفت وجوبى",
        "عدم الصلاحيه الفنيه",
        "الاستقاله",
        "عدم رغبه فى التجنيد",
        "الوفاة اثناء الخدمه",
        "الوفاة اثناء الغياب",
        "بلوغ السن القانونى",
        "رفت طبي",
        "نقل خارج السلاح",
        "عدم اللياقة الطبية",
        "امني",
        "هارب",
        "إجراءات إنهاء خدمة"
      ].map(text => ({ text }))
    ]
  },
  leavels: {
    text: "text",
    value: "text",
    data: [
      "دورة رقيب اول",
      "دورة ملازم ",
      "دورة رقيب",
      "دورة مساعد",
      "صانع دقيق",
      "صانع ممتاز",
      "ملاحظ فني",
      "إختبار هيئة مساعد",
      "إختبار هيئة صانع دقيق",
      "إختبار هيئة ملازم شرف",
      "إختبار هيئة ملازم فني",
      "إختبار هيئة صانع ممتاز",
      "دورة رقيب سائق"
    ]
  },
  beneficials: {
    text: "text",
    value: "text",
    data: [
      "الأسرة",
      "الوالد",
      "حرمه",
      "حرمه / نجله",
      "شخصه",
      "شخصه / حرمه",
      "شقيقه",
      "شقيقته",
      "نجله",
      "نفسه",
      "والدته",
      "والده"
    ]
  },
  degrees: {
    text: "text",
    value: "text",
    data: [
      "ممتاز",
      "جيد جدا",
      "جيد",
      "مقبول",
      "ضغيف",
      "قصر",
      "متخلف",
      "إلغاء",
      "مقصر 1",
      "مقصر 2",
      "مقصر 3",
      "مقصر 4",
      "مضى",
      "ترقي بدون تأهيل"
    ]
  },
  College: {
    text: "text",
    value: "text",
    data: [
      ...[
        "فوق متوسطة",
        "متوسطة",
        "عادة",
        "اداب",
        "هندسة",
        "حاسبات ومعلومات",
        "تربية",
        "طب بشري",
        "طب بيطري",
        "طب اسنان",
        "صيدلة",
        "الالسن",
        "خدمة اجتماعيه",
        "جامعة عمالية",
        "حقوق",
        "تجارة",
        "زراعة",
        "شريعة وقانون",
        "دراسات اسلامية",
        "اصول دين",
        "فنون جميلة",
        "فنون تطبيقية",
        "اقتصاد وعلوم سياسية",
        "اعلام",
        "تربية رياضية",
        "علوم",
        "سياحة وفنادق",
        "تربية نوعية",
        "تمريض",
        "تربية موسيقية",
        "تربية فنية",
        "اثار",
        "دار العلوم"
      ].map(text => ({ text }))
    ]
  },
  FollowingRecommender: {
    text: "text",
    value: "text",
    data: [
      ...[
        "",
        "عقيد إيهاب جاهين",
        "عميد احمد نور",
        "فرع الشؤون المعنوية",
        "مذكرة الاستاد",
        "مذكرة الأمن",
        "مذكرة الدار",
        "مذكرة السجلات",
        "مذكرة الفرع المالى",
        "مذكرة الفندق",
        "مذكرة المتابعة",
        "مذكرة المنفذ",
        "مذكرة شعبة الامداد",
        "مذكرة شعبة تنظيم",
        "مذكرة شعبة عمليات",
        "مذكرة فرع الاتصال",
        "مذكرة فرع القضاء",
        "مذكرة فرع النظم",
        "مذكرة ك المقر",
        "مكتب القائد",
        "مكتب رئيس اركان",
        "مكتب نائب القائد"
      ].map(text => ({ text }))
    ]
  },
  FollowingOrder: {
    text: "text",
    value: "text",
    data: [
      ...[
        "",
        "قائد القوات",
        "رئيس الأركان",
        "مكتب القائد",
        "مكتب نائب القائد"
      ].map(text => ({ text }))
    ]
  },

  GeneralDirection: {
    text: "text",
    value: "text",
    data: [
      ...[
        "ح ح الجنوبى",
        "ح ح الشمالى",
        "ح ح الغربى",
        "ح ح المركزى",
        "ح ح ج2 ميد",
        "ح ح ج3 ميد",
        "قيادات القطاعات",
        "قيادة الفوج 103",
        "قيادة الكتيبة 104",
        "ك م م م مد",
        "مج المخابرات"
      ].map(text => ({ text }))
    ]
  },
  GeneralDirection: {
    text: "text",
    value: "text",
    data: [
      ...[
        "ح ح الجنوبى",
        "ح ح الشمالى",
        "ح ح الغربى",
        "ح ح المركزى",
        "ح ح ج2 ميد",
        "ح ح ج3 ميد",
        "قيادات القطاعات",
        "قيادة الفوج 103",
        "قيادة الكتيبة 104",
        "ك م م م مد",
        "مج المخابرات"
      ].map(text => ({ text }))
    ]
  },
  DirectionforFeaat: {
    text: "text",
    value: "text",
    data: [
      ...[
        "المركزى",
        "ج2",
        "ج3",
        "جنوبى",
        "رئاسة مج مخ والأمن",
        "رئاسة ومكاتب مج مخ البحر الأحمر",
        "رئاسة ومكاتب مج مخ الجنوبى",
        "رئاسة ومكاتب مج مخ الشمالى",
        "رئاسة ومكاتب مج مخ الغربى",
        "رئاسة ومكاتب مج مخ ج2 ",
        "رئاسة ومكاتب مج مخ ج3",
        "شمالى",
        "غربى",
        "قيادة الفوج 103",
        "قيادة الكتيبة 104",
        "قيادة شرق القناه لمكافحة الإرهاب",
        "قيادة فطاع ح ح الجنوبى",
        "قيادة فطاع ح ح الشمالى",
        "قيادة فطاع ح ح الغربى",
        "قيادة فطاع ح ح جـ 2 ميد",
        "قيادة فطاع ح ح جـ 3 ميد",
        "قيادة فوج بوابات الكشف عن المهربات",
        "كتائب م م م د"
      ].map(text => ({ text }))
    ]
  },
  Direction: {
    text: "text",
    value: "text",
    data: [
      ...[
        "",
        "ج2",
        "ج3",
        "جنوبى",
        "شمالى",
        "غربى",
        "مركزى",
        "مج المخابرات",
        "رئاسة مج مخ والأمن",
        "رئاسة ومكاتب مج مخ البحر الأحمر",
        "رئاسة ومكاتب مج مخ الجنوبى",
        "رئاسة ومكاتب مج مخ الشمالى",
        "رئاسة ومكاتب مج مخ الغربى",
        "رئاسة ومكاتب مج مخ ج2 ",
        "رئاسة ومكاتب مج مخ ج3",
        "قيادات القطاعات",
        "كتائب م م م د",
        "قيادة الفوج 103",
        "قيادة الكتيبة 104"
      ].map(text => ({ text }))
    ]
  },
  Formation: {
    text: "text",
    value: "text",
    data: [
      ...["", "ج2", "ج3", "جنوبى", "شمالى", "غربى", "مركزى"].map(text => ({
        text
      }))
    ]
  },
  ShapeTypes: {
    text: "text",
    value: "text",
    data: [
      ...["خارج الشكل", "داخل الشكل"].map(text => ({
        text
      }))
    ]
  },
  years: [
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025,
    2026,
    2027,
    2028,
    2029,
    2030
  ],
  sections: [
    {
      text: "مدير النظام",
      value: 0
    },
    {
      text: "نظم",
      value: 12
    },
    {
      text: "تسجيل",
      value: 1
    },
    {
      text: "المستجدين",
      value: 2
    }
  ],
  dailesSoliderCategories: [
    "صف",
    "كاتب عسكرى",
    "كاتب مالى",
    "مهنى",
    "حرفى",
    "سائق عجل"
  ],
  serviceTypes: [{ text: "راتب عالى" }, { text: "مجند" }, { text: "رع/مجند" }],
  serviceTypesMap: {
    highLevel: "راتب عالى",
    solider: "مجند"
  },
  harsHododId: 52,
  ServiceStyle: ["متطوع", "مكلف"],
  RatebCategoryFari: {
    text: "text",
    value: "text",
    data: ["", "معلم", "قصاص أثر"].map(text => ({
      text
    }))
  },
  summryofcrime: {
    data: ["غياب ", "حبس ", "السلوك المضر بالربط والضبط", "الاهمال"].map(
      text => ({
        text
      })
    )
  },
  kindofpunshments: {
    data: ["عقوبة انضباطية", "محكمة عسكرية ", "محكمة مدنية "].map(text => ({
      text
    }))
  },
  SoliderOfficer: [
    {
      text: "جندي"
    },
    {
      text: "ظابط"
    }
  ],
  punshments: {
    data: [
      "حجز بالمعسكر",
      "حجز مع القطع",
      "حبس ",
      "حبس احتياطى",
      "حبس مع ايقاف الشامل ",
      "حبس مع ايقاف المؤقت",
      "الاشغال الشاقة ",
      "الاعدام رميا بالرصاص",
      "الاعدام شنقا ",
      "البراءة ",
      "التكدير",
      "التكليف بخدمة زيادة ",
      "الحجز بالوحدة اقصاة 10 يوم ",
      "الحجز بالوحدة اكثر من 15 يةم حد اقصى 45",
      "الحرمان من العلاوات الاضافية 3شهور",
      "الحرمان من العلاوات الاضافية لاكثر  3شهور",
      "الحرمان من درجو الوكالة ",
      "الخصم ",
      "الرفت من الخدمة بالقوات المسلحة ",
      "السجن ",
      "العزل من الوظائف الاميرية ",
      "الغرامة المالية مع ايقاف التنفيذ",
      "انقضاء الدعوى بالتقادم",
      "انقضاء الدعوى بالتنازل",
      "انقضاء الدعوى بالصلح",
      "تنزيل درجة  ",
      "حبس وغرامة  ",
      "غرامية مالية ",
      "نصيحة "
    ].map(text => ({
      text
    }))
  },
  extraProfitType: {
    data: ["مجهود عالي", "مجهود متوسط", "بدون مجهود"].map(text => ({
      text
    }))
  },
  ratebLevels: [
    "طالب ",
    "عريف ",
    "رقيب ",
    "رقيب أ",
    "مساعد ",
    "مساعد ا",
    "صانع ",
    "صانع دقيق ",
    "صانع ماهر ",
    "صانع ممتاز ",
    "ملاحظ فنى "
  ],
  militaryTypes: ["مجند", "راتب عالي", "ضابط"],
  workPlaceCategory: {
    data: ["داخل قيادة قوات حرس الحدود", "خارج قيادة قوات حرس الحدود"].map(
      text => ({
        text
      })
    )
  },
  grads: ["امتياز", "جيد جدا", "جيد ", "مقبول", "ضعيف "]
};
